app/controllers/categories_controller.rb

  def index
    @categories = Category.includes(:parent)
---
SELECT "categories".* FROM "categories"  WHERE "categories"."parent_id" = ?  [["parent_id", 1]]